<?php 
	require_once "databaseutil.php";

	class wechat_globle
	{ 
		public function getzhidaowords()
		{ 
			$words_zhidao = array('闹心', '失恋', '难过', '头疼', '痛苦', '死亡', '无聊');
			return $words_zhidao;
		}
		public function getwordsarray()
		{
			$namesArray = array( "反共", "家宝", "锦涛", "熙来", "近平", "六四", "天安门事件", "文化大革命","共党","共产党","毛", "国民党", "中共", "法轮");
			return $namesArray;
		}
		public function getwikiarray()
		{
			$namesArray = array( "反共", "六四", "天安门事件", "文化大革命", '法轮');
			return $namesArray;
		}
		public function getfunarray()
		{ 
			$funArray = array(
			//"【换取图片】\n发送图片，就能随机得到别人分享的一张图片\n",
			//"【微英语】\n让英语学习变得高效和有趣！\n",
			//"【明星资讯】\n搜索感兴趣的明星新闻\n",
			//"【明星资料】\n搜索感兴趣的明星资料\n",
			"【图片搜索】\n快速搜索图片，省流量\n",
			"【快递查询】\n快递 方便查\n",
			"【头条新闻】\n快速浏览今日头条新闻\n",
			//"【最热微博】\n快速浏览最热微博\n",
			"【藏头诗】\n即兴为您献上藏头诗\n",
			//"【吃喝玩乐】\n搜索周边吃喝玩乐的地方\n",
			"【姓名大作战】\n很好玩的名字打架\n",
			"【今日人品】\n看看你今天人品如何\n",
			//"【点歌】\n点你想听的歌\n",
            "【查天气】\n一周天气尽在掌握\n",
            "【查空气】\n空气质量掌握\n",
			"【回答各种问题】\n我是万事通，上知天文下知地理\n",
			"【中英互译】\n中英文互译\n",
			//"【成语查询】\n查查博大精深的成语\n",
			"【爆笑糗事】\n笑破你的肚子\n",
			//"【回顾每日一条】\n经典美文、励志常识等\n",
			"【解梦大师】\n为你解梦\n",
			"【列车车次查询】\n查看列车时刻表\n",
			//"【列车站站查询】\n查看火车列次\n",
			"【歌词查询】\n快速获取歌词\n",
			//"【历史上的今天】\n",
			//"【百科全书】\n有什么词不懂的选这个\n",
			"【新闻资讯】\n搜索感兴趣的新闻\n",
			"【星座运势】\n星座运势天天有\n",
			//"【农历快查】\n快速查询农历\n",
			"【脑筋急转弯】\n看看你脑筋能不能转弯\n",
			"【科普知识】\n生活百科十万个为什么\n",
			"【心里话】\n说出你的心里话");
			
			return $funArray;
		}
		public function getfundetailsarray()
		{ 
			$express = "目前支持的快递查询有\n";
			$kuaidiArray = array('顺丰','申通','汇通','凡客','速尔','联邦','中通','天天','圆通','UPS','EMS','全峰','韵达','宅急送');
			foreach($kuaidiArray as $k){
				$express .= $k;
				$express .= "\n";
			}				
			$express .= "请在相应快递后面加上单号，如输入：\n顺丰 028376220863";
			
			$funArray = array(
			//"【换取图片】\n发送一张图片，就能随机得到别人分享的一张图片，快来看看有什么惊喜吧\n",
			//"【微英语】\n获取微英语，请回复e\n",
			//"【明星资讯】\n快速搜索您喜欢的明星、名人的最新新闻，如输入:\n新闻 吴彦祖\n",
			//"【明星资料】\n快速搜索你感兴趣的明星的资料，请以问号?开头，如输入:\n?林心如",
			//"【公交地铁查询】\n"."公交/地铁 线路查询，输入格式：公交 城市 起点 终点\n"."如输入："."\n公交 北京 东直门 西直门",
			"【图片搜索】\n快速搜索图片，省流量\n,如输入：\n彩虹图片",
			"【快递查询】\n".$express,
			"【头条新闻】\n快速浏览今日头条新闻\n\n",
			//"【最热微博】\n快速浏览最热微博\n\n",
			"【藏头诗】\n以'cts'开头，后面跟上内容就行啦，比如输入：\ncts 我爱小丹\ncws 我爱小丹",
			//"【吃喝玩乐】\n发送你的位置(输入框旁边的+号点开，选择位置再发送)，就可以搜索周边的电影院、KTV、ATM等你想要找的店啦\n",
			"【姓名大作战】\n很好玩的名字打架，可以看你和朋友谁厉害哦~ 还可以看看哪个明星最厉害\n输入格式如下:\n李小四vs张小三\n",
			"【今日人品】\n看看今天人品怎样，以名字开头，如输入：\n李小四人品\n",
			//"【点歌】\n请以点歌两个字开头，后面再跟上歌曲名，或者以*号隔开歌曲和歌手，如输入：\n点歌 天使*五月天\n点歌  单身情歌\n点歌随机\n\n播放时需要时间缓冲请等待，如果不能播放，获取下一首请回复d",
			"【查天气】\n一周天气预报，实时天气情况，都快速掌握，如输入：\n杭州天气\n",
            "【查空气】\n空气质量实时掌握，如输入：\n杭州空气\n",
			"【回答各种问题】\n有什么想知道的问题随便问，省流量快速获取答案\n请以'?'开头，如输入:\n? 怎么表白",
			"【中英互译】\n以冒号开头，后面跟上要翻译的中文或英文，输入格式:\n：你要翻译的中英文\n",
			//"【成语查询】\n输入格式:\n以一开头的成语\n以天结尾的成语\n含爱的成语\n",
			"【爆笑糗事】\n笑翻天的糗事笑话，经常都有更新，每条都不一样，无穷无尽的笑话等你来~ \n输入：笑话\n",
			//"【回顾每日一条】\n每天20点-22点都会发送一条信息，包含励志、美文、常识、搞笑等各种不同有价值的信息，回顾以往，请输入：\n每日一条\n还可以搜索指定含有文字或时间，格式如下：\n每日一条 2013-07-01\n每日一条 珍惜",
			"【解梦大师】\n你会经常做梦吗？你想知道梦的含义吗？快来这里看看吧~\n输入格式：\n梦见老师\n",
			"【列车车次查询】\n快速查看列车时刻表，直接输入车次，如：T31\n",
			//"【列车站站查询】\n快速查看所有车次，请以'火车'开头，后面跟上起点和终点，以空格隔开，如输入：\n火车 上海 杭州\n",
			"【歌词查询】\n快速获取想要的歌词，按歌名搜索，输入格式如：\n歌词 东风破\n按歌名歌手，输入格式如：\n歌词 东风破 周杰伦\n",			
			//"【历史上的今天】\n快来看看历史上的今天都发生了什么吧~ 直接输入：今天\n",
			//"【百科全书】\n以问号开头，后面跟上你想知道的名词，比如明星啊，学校啊，地点啊等等都可以，如输入：\n ?紫禁城\n",
			"【新闻资讯】\n搜索你关心的话题，关于你的母校，你的偶像，你的家乡等，请以'新闻'开头，如输入:\n新闻 禽流感\n",
			"【星座运势】\n星座运势天天为你准备~ \n输入你的星座，如：\n白羊\n白羊 周运势\n白羊 月运势\n白羊 年运势\n",
			//"【农历快查】\n快速查询农历，\n输入格式有几种如下：\n今天农历\n 20130710\n2013年2月3日",
			"【脑筋急转弯】\n看看你脑筋能不能转弯，回复：\njzw\n",
			"【科普知识】\n生活百科十万个为什么，回复:\nw\n",
			"【心里话】\n许下你dē诺言，写下你想对ta说的话，送出对ta默默地祝福，留下你的抱怨你的委屈你的感激。\n"
				."直到有一天ta在这里看到，或者哪一天你重新来这里找回回忆，都不失为一件让人愉快的事情。\n"
				."留下一份回忆，也给ta一个惊喜！\n\n"
				."你还可以在这里发布交友信息哦~很多人会看到的！！\n\n"
				."【请回复以下相应字母】\n"	
				."回复 ta 发表你想对ta说的心里话\n"
				."回复 mm 找朋友找对象\n"
				."回复 kk 查看最新发布\n"
				."回复 kta 查看指定名字收到的告白\n\n");
			
			return $funArray;
		}
		public function surprise(){ 
			$funArray = $this->getfunarray();
			return $funArray[rand(0, count($funArray)-1)];
		}
		//欢迎新用户
		public function welcome($fromUserName){
			$num = d_insertuser($fromUserName) * 10;
			$contentStr  = '';
			if(strlen($num) > 0){
				$contentStr = "\n-----------\n您好，第 $num 位用户~ \n感谢支持";
			}else{
				$contentStr = "\n-----------\n感谢支持！";
			}  
			return $contentStr;
		}
		//帮助
		public function help()
		{		
			$funArray = $this->getfunarray();		
			$contentStr = "方便有趣更省流量。\n请回复以下相应序号：\n";
			$c = count($funArray); 
			for($i = 0; $i < $c; $i++){
				$contentStr .= $i.".".$funArray[$i];
			} 
		//	$contentStr .="\n有时由于网络因素不能回复信息时请重发~\n";
			$contentStr .= "\n请回复以上相应序号，或说出你想要的功能。\n\n 【发送kk 查看最新匿名小纸条】";
			
			return $contentStr;
		}
		
		public function getfun($keyword)
		{ 
			$motion = array("/:@>/:<@", "/:B-)","/::>","/::,@","/::D","/::)","/::P","/::$","/:,@-D","/:,@P",
				"◑▂◐","◑０◐","◑︿◐","◑ω◐","◑﹏◐","◑△◐","◑▽◐",
				"╯▂╰","╯０╰","╯︿╰","╯ω╰","╯﹏╰","╯△╰","╯▽╰"
			);  
			$funarray = $this->getfundetailsarray();			
			$contentStr = $funarray[$keyword];
			return $contentStr;
		}
	} 
?>