<?php
//$webchat_renpinObj = new webchat_renpin();
//echo $webchat_renpinObj->getdata('陈帆');
class webchat_renpin
{
	public function getdata($keywords){
		date_default_timezone_set('PRC');
		$keywords .= date('Y-m-d');
		$md5 = md5($keywords);
		$re = 0;
		$c = strlen($md5);
		for($i = 0; $i < $c; $i++){
			$re += ord(substr($md5, $i, 1)) ; 
		}  
		$num = intval(intval($re % 100) / 5); 
		$words = $this->getArray();
		return "今日人品得分：".intval($re % 100)."\n评价：".$words[$num]."\n明天再来看看吧~~";
	}
	function getArray(){
		$words = array(
		"我勒个去！你居然一点人品都没有？！快做点好事吧。。",
		"算了，今天跟你没什么人品好谈的...",
		"是我不好...不应该跟你谈人品问题的...我一边凉快去了",
		"这人品，是不是小时候没扶过老奶奶过路啊..哼哼 被我发现啦",
		"你貌似应该三岁就偷看隔壁姐姐洗澡的吧...",
		"你的人品之低下实在让人惊讶啊...我无语凝噎",
		"你的人品太差了。你应该有干坏事的嗜好吧?那轮胎是不是你扎破的...?!",
		"你的人品真差!肯定经常做偷鸡摸狗的事...有能力去偷个异性的心来呵护啊..",
		"你拥有如此差的人品请经常祈求佛祖保佑你吧...祈求上帝也行...",
		"老实交待..那些论坛上面经常出现的偷拍照是不是你的杰作?好人一生平安~你懂得亲",
		"哎，不是我说你。。。你随地大小便之类的事没少干吧?",
		"你的人品太差了..稍不小心就会去干坏事了吧?比如偷偷亲了一下那个谁谁",
		"你的人品很差了..要时刻克制住做坏事的冲动哦..从善如流，从恶如崩..",
		"你的人品比较差了..要好好的约束自己啊..一念天堂一念地狱。。",
		"你的人品勉勉强强..要自己好自为之..不要气馁。。多请客吃饭..",
		"现在这社会啊 孩子，有你这样的人品算是不错了..",
		"你有较好的人品..继续保持..继续努力...I believe you",
		"你的人品不错..应该一表人才吧?人见人爱花见花开吧？",
		"你的人品真好..做好事应该是你的爱好吧..",
		"你的人品太好了..雷锋什么的都要向你学习呢..失物招领处的东西都是你捡的吧",
		"你是世人的榜样！人类的楷模！玉米面包全给你啦！！",
		"天啦！你不是人！你是神！！！神原来也是人，因为做了人做不到的事，所以成了神。说吧，你做什么大事？！"
		);
		
		return $words;
		
	
	}
}

?>